[
  {
    "id": 1,
    "checked": "false",
    "favorites": "false",
    "data": {
      "title": "HTML и CSS. Путь к совершенству",
      "author": "Бен Хеник",
      "link": "https://www.ozon.ru/context/detail/id/5648483/",
      "description": "HTML и CSS являются основными рабочими инструментами в современном веб-дизайне и веб-программировании. Параллельное использование этих технологий для создания качественных интернет-сайтов требует от разработчика не только знания самих языков программирования, но и 'продвинутых' техник и приемов, позволяющих изящно решать поставленные задачи, тратя на это намного меньше времени и усилий. С помощью данной книги вы узнаете, как эффективно использовать в своей работе подобные техники. Неважно, верстаете ли вы HTML-страницы вручную или используете в своей работе готовые шаблоны, - это издание поможет вам более продуктивно работать на каждом из этапов разработки сайта: от разметки страниц до использования типографики и работы с цветом."
    }
  },
  {
    "id": 2,
    "checked": "true",
    "favorites": "true",
    "data": {
      "title": "JavaScript. Подробное руководство",
      "author": "Дэвид Флэнаган",
      "link": "https://www.ozon.ru/context/detail/id/3881091/",
      "description": "Пятое издание бестселлера 'JavaScript. Подробное руководство' полностью обновлено. Рассматриваются взаимодействие с протоколом HTTP и применение технологии Ajax, обработка XML-документов, создание графики на стороне клиента с помощью тега 'canvas', пространства имен в JavaScript, необходимые для разработки сложных программ, классы, замыкания, Flash и встраивание сценариев JavaScript в Java-приложения. Часть I знакомит с основами JavaScript. В части II описывается среда разработки сценариев, предоставляемая веб-броузерами. Многочисленные примеры демонстрируют, как генерировать оглавление HTML-документа, отображать анимированные изображения DHTML, автоматизировать проверку правильности заполнения форм, создавать всплывающие подсказки с использованием Ajax, как применять XPath и XSLT для обработки XML-документов, загруженных с помощью Ajax. Часть III - обширный справочник по базовому JavaScript (классы, объекты, конструкторы, методы, функции, свойства и константы, определенные в JavaScript 1.5 и ECMAScript v3). Часть IV - справочник по клиентскому JavaScript (API веб-броузеров, стандарт DOM API Level 2 и недавно появившиеся стандарты: объект XMLHttpRequest и тег 'canvas')."
    }
  },
  {
    "id": 3,
    "checked": "false",
    "favorites": "false",
    "data": {
      "title": "Веб-приложения на JavaScript",
      "author": "Алекс Маккоу",
      "link": "https://www.ozon.ru/context/detail/id/8798187/",
      "description": "Поддержка HTML5 и CSS3 с каждым днем становится все качественнее и полнее, но вам необходимо решить, основываясь на вашей клиентской аудитории, где именно можно использовать данные технологии. Ведь создание на языке JavaScript многофункциональных rich-приложений, которые выполняются на стороне клиента, - непростая задача. Это книга поможет вам изучить все приемы, используемые для создания самых современных JavaScript-приложений, в том числе структуры, использование MVC, фреймы, связь с сервером и кросс-доменные запросы, создание приложений реального времени и многое другое. Чтобы помочь вам понять концепции разработки JavaScript-приложений, рассмотрена работа реальных приложений. Для опытных разработчиков."
    }
  },
  {
    "id": 4,
    "checked": "false",
    "favorites": "true",
    "data": {
      "title": "JavaScript. Шаблоны",
      "author": "Стоян Стефанов",
      "link": "https://www.ozon.ru/context/detail/id/6287517/",
      "description": "Разработчики серверных, клиентских или настольных приложений на JavaScript нередко сталкиваются с проблемами, связанными с объектами, функциями, наследованием и другими особенностями этого языка. Какие же приемы разработки приложений на JavaScript являются наиболее удачными? Данная книга дает ответ на этот вопрос, предлагая большое количество различных шаблонов программирования на JavaScript, таких как 'единственный объект' (singleton), 'фабрика' (factory), 'декоратор' (decorator) и другие. Можно сказать, что они являются не только методами решения наиболее типичных задач разработки ПО, но и заготовками решений для целых категорий таких задач. Использование шаблонов при программировании на языке JavaScript имеет свои особенности. Некоторые из них, разработанные с позиций языков со строгим контролем типов, таких как C++ и Java, не могут непосредственно применяться в языках с динамической типизацией, таких как JavaScript. Для таких шаблонов в языке JavaScript имеются более простые альтернативы. Написанная экспертом по языку JavaScript Стояном Стефановым - ведущим специалистом компании Yahoo! и создателем инструмента оптимизации производительности веб-страниц YSlow 2.0, - книга включает практические советы по реализации каждого из рассматриваемых шаблонов с примерами программного кода. Автор также приводит антишаблоны - приемы программирования, которых следует по возможности избегать."
    }
  },
  {
    "id": 5,"favorites": "true",
    "checked": "false",

    "data": {
      "title": "Алгоритмы. Вводный курс",
      "author": "Томас Х. Кормен",
      "link": "https://www.ozon.ru/context/detail/id/24903185/",
      "description": "Эта книга написана признанным авторитетом в области компьютерных алгоритмов - профессором информатики Томасом Корменом, чей труд 'Алгоритмы. Построение и анализ', написанный в соавторстве с такими выдающимися учеными, как Чарльз Лейзерсон, Рональд Ривест и Клиффорд Штайн, выдержав три издания, давно стал общепризнанным классическим учебником по алгоритмам. Поскольку книга 'Алгоритмы. Построение и анализ' предназначена в первую очередь для студентов и аспирантов, то есть подразумевает достаточно серьезную математическую подготовку, Т.Кормен написал книгу, предназначенную для всех, кого интересуют вопросы, связанные с компьютерными алгоритмами, но базовое образование, да и просто отсутствие времени не позволяют взяться за серьезный труд объемом более 1300 страниц. При всей простоте и легкости изложения эту книгу, как и все вышедшее из-под пера Т.Кормена, отличают точность, широкий спектр охватываемых вопросов, глубина изложения. Основной предполагаемый читатель этой книги - молодой человек, раздумывающий, стоит ли ему заниматься этой областью человеческой деятельности или нет. Но в любом случае, знания никогда не бывают лишними, так что даже если в конечном итоге вы поймете, что алгоритмы - не ваше предназначение, все равно ваше время не будет потрачено зря - ведь алгоритмы окружают нас всюду, а компьютерные алгоритмы - всего лишь их разновидность."
    }
  },
  {
    "id": 6,
    "checked": "false",
    "favorites": "false",
    "data": {
      "title": "Совершенный код. Мастер-класс",
      "author": "Стив Макконнелл",
      "link": "https://www.ozon.ru/context/detail/id/138437220/",
      "description": "Более 10 лет первое издание этой книги считалось одним из лучших практических руководств по программированию. Сейчас эта книга полностью обновлена с учетом современных тенденций и технологий и дополнена сотнями новых примеров, иллюстрирующих искусство и науку программирования. Опираясь на академические исследования, с одной стороны, и практический опыт коммерческих разработок ПО - с другой, автор синтезировал из самых эффективных методик и наиболее эффективных принципов ясное прагматичное руководство. Каков бы ни был ваш профессиональный уровень, с какими бы средствами разработками вы ни работали, какова бы ни была сложность вашего проекта, в этой книге вы найдете нужную информацию, она заставит вас размышлять и поможет создать совершенный код. Книга состоит из 35 глав, предметного указателя и библиографии."
    }
  },
  {
    "id": 7,
    "checked": "true",
    "favorites": "true",
    "data": {
      "title": "React.js. Быстрый старт",
      "author": "Стоян Стефанов",
      "link": "https://www.ozon.ru/context/detail/id/139961087/",
      "description": "Незаменимая вводная книга по технологии React для взыскательных JavaScript-разработчиков. Все самое интересное о сверхпопулярном инструменте от компании Facebook. В книге рассмотрены основные концепции высокопроизводительного программирования при помощи React, реальные примеры кода и доступные блок-схемы. Прочитав ее, вы научитесь:Создавать и использовать собственные компоненты React наряду с универсальными компонентами DOMПисать компоненты для таблиц данных, позволяющие редактировать, сортировать таблицу, выполнять в ней поиск и экспортировать ее содержимоеИспользовать дополнительный синтаксис JSX в качестве альтернативы для вызовов функцийЗапускать низкоуровневый гибкий процесс сборки, который освободит вам время и поможет сосредоточиться на работе с ReactРаботать с инструментами ESLint, Flow и Jest, позволяющими проверять и тестировать код по мере разработки приложенияОбеспечивать коммуникацию между компонентами при помощи FluxВ итоге у вас получится полноценное веб-приложение, позволяющее сохранять данные на стороне клиента."
    }
  },
  {
    "id": 8,
    "checked": "true",
    "favorites": "true",
    "data": {
      "title": "Основы REDUX",
      "author": "Максим Пацианский",
      "link": "https://www.goodreads.com/book/show/33850478-redux",
      "description": "В данном учебном курсе вы найдете 2 раздела:ПодготовкаТеория redux и создание веб-приложения по шагамЕсли вам интересно, именно выполнение асинхронных действий и работа с VK API, вы можете прочитать соответствующие главы.Курс предополагает, что читатель уже знаком с React.js. Если вы не знакомы, рекомендую для начала ознакомиться с курсом React.js для начинающих.Результатом изучения должно стать умение у читателя разрабатывать приложения с помощью Redux, опираясь строго на однонаправленный поток данных и другие правила данной технологии. Курс охватывает все типовые вопросы (как показать preloader, как отобразить ошибку в результате асинхронного запроса и т.д.), но не затрагивает вопросы серьезной оптимизации сборки webpack'а и написания тестов."
    }
  }
]